app/controllers/products_controller.rb

SELECT "products".* FROM "products"  WHERE "products"."on_sale" = 't'
---
  def home
    @products = Product.where(on_sale: true)

INSERT INTO "products" ("cost_price", "cover_picture", "created_at", "description", "featured", "name", "on_sale", "price", "sku", "updated_at", "weight") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save